{
    "name": "Connectors",
    "icon": "create:gearbox",
    "category": "patchouli:create",
    "pages": [

        {
            "type": "text",
            "text": "Connectors are essential for connecting machines together. They are used in many different ways, including for connecting machines, transporting items, and even powering machines. Here are some of the different types of connectors:"
        },

        {
            "type":"crafting",
            "recipe":"create:crafting/kinetics/shaft",
            "text": "Shaftes are one of the basic connectors of the Create mod. They are used to connect machines together, transporting items, and powering machines. They are very essential in the functioning of the machines"
        },
        
        {
            "type": "crafting",
            "recipe":"create:crafting/kinetics/gearbox",
            "text": "They are machines which transport rotational power but in the opposite direction. It is used to trasport rotation in different directions. It is also used to craft other machines and is virual in making any machine that isnt a straight line its main use is in production lines."
        },

        {
            "type":"crafting",
            "recipe":"create:crafting/kinetics/cogwheel",
            "text": "Cogwheels just like shafts, are essential for connecting machines together just like gearboxes cogwheels also can trasfer rotation in every direction when connected to an adjucent cogwheel in the said diretion"
        },

        {
            "type":"crafting",
            "recipe": "create:crafting/kinetics/large_cogwheel",
            "text": "Just like the cogwheel, large cogwheel are also used to trasnfer power in diffrent direction but unlike cog, large cogwheel can trasfer rotation 2 blocks far away because of its large frame."
        },

        {
           "type":"crafting",
           "recipe":"create:crafting/kinetics/belt_connector",
           "text": "Belts can be very useful as they can trasfer items from one place to another along with rotation rotation can be trasfered up and down in straight line but items cant."
        },

        {
           "type": "crafting",
           "recipe": "create:crafting/kinetics/gearshift",
           "text":"Gearboxes are connectors that are effected by redstone it normally relies rotation in a straight line in the same rotation but if powerd by redstone, it turns in the poosite of the input rotation." 
        },

        {
            "type":"crafting",
            "recipe": "create:crafting/kinetics/clutch",
            "text": "Just like gearshifts, clutches are also connectors that get affted by redtone it relies rotation in straight line when powered it stops the connection stoping the flow of rotation through it."
        },

        {
            "type": "crafting",
            "recipe": "create:crafting/kinetics/encased_chain_drive",
            "text": "Encased chain drives are very useful as they connect with one another and can rely rotation in the same direction. whats cool about the connector is using wrench any face can be turned 90 degrees."
        },

        {
            "type": "crafting",
            "recipe": "create:crafting/kinetics/adjustable_chain_gearshift",
            "text":"These are an advanced verson of chain drives which can all be activated using redstone which either increases or decreases its rotation based on its placement."
        },

        {
            "type": "crafting",
            "recipe": "create_connected:crafting/kinetics/encased_chain_cogwheel",
            "text": "Encased chain cogwheels are cogwheel verson of the drives they are useful as they can connect with one another and can rely rotation in the same direction. whats cool about the connector is using wrench any face can be turned 90 degrees."
        },

        {
            "type": "crafting",
            "recipe": "create_connected:crafting/kinetics/overstress_clutch",
            "text": "Overstress clutch is a very useful connector as it can stop the flow of rotation through it when the network is overstressed after a given time it can b used as a break or fuse incase of emergency and can be very useful in factories."
        },
        
        {
            "type": "crafting",
            "recipe": "create_connected:crafting/kinetics/centrifugal_clutch",
            "text": "Centrifugal clutch is a very useful connector as it only coupled and lets rotation in if it is more then the given amount. It can be useful in factories to create an overflow or to have machines running only at a certain speed"
        },

        {
          "type":"crafting",
          "recipe": "create_connected:crafting/kinetics/freewheel_clutch",
          "text": "It is just like the centrigugal cluth but insted it is only coupled when the network is rotating in the correct direction as configured."
        }
    ]
}